JoshuaRau-joshrau/Paintings_App1/app/controllers/paintings_controller.rb

  def index
    @paintings = Painting.search(params[:q])
---
SELECT "paintings".* FROM "paintings" WHERE (painting_title || artist || museum LIKE '%scream%')

  def show
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", 10]]

  def create
    @painting = Painting.new(painting_params)
    respond_to do |format|
      if @painting.save
---
INSERT INTO "paintings" ("painting_title", "artist", "museum", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", 15]]

  def update
    @painting = Painting.find(params[:id])
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", 15]]