JoshuaRau-joshrau/Movie_App1/app/controllers/movies_controller.rb

  def index
  	@movies = Movie.search(params[:q])
---
SELECT "movies".* FROM "movies" WHERE (title || description || year_released LIKE '%1994%')

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "year_released", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Blair Witch Project"], ["description", "night hike gone bad"], ["year_released", 1998], ["created_at", "2015-04-16 05:26:25.067312"], ["updated_at", "2015-04-16 05:26:25.067312"]]

  def update
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 47]]